notes/talks/multidispatch_vs_case/compare.org
* raku case vs multidispatch
** case
*** uses lexical sequence to order comparisons
** multidispatch
*** uses specificity to order comparisons (mostly)
**** in the case of subsets, uses order of definition
***** subsets are essentially grouped by the type they're based on
***** BUT they don't behave like two multis with same type
****** uses the order of definition for subsets based on same type 

** would've like to say:

*** case
**** running a gauntlet, an obvious lexically determined order of comparisons 
*** multi
**** orders types by "specificity", not lexically (not entirely true)
**** code that handles various types can be scattered, defined in different places
